[
    {
        "id": "primeiro-computador",
        "titulo": "The First Computer",
        "desenvolvedores": [
            "John Presper Eckert (Engineer)",
            "John Mauchly (Engineer)"
        ],
        "dataInicio": "1943",
        "dataFim": "1945",
        "local": "University of Pennsylvania, Philadelphia, USA",
        "resumo": "The ENIAC (Electronic Numerical Integrator and Computer) was the first general-purpose electronic computer, revolutionizing how calculations were performed and marking the beginning of the computer age. Originally developed for the United States Army during World War II, the ENIAC was designed to calculate artillery tables but quickly became a key tool in scientific and industrial research.",
        "especificacoes": [
            "Dimensions",
            "Components",
            "Processing capacity",
            "Manual programming"
        ],
        "detalhamento": [
            "With an impressive 30 tons, the ENIAC occupied an entire room of approximately 167 square meters, equivalent to a small house.",
            "Equipped with 17,468 vacuum tubes, 7,200 crystal diodes, 1,500 relays, 70,000 resistors, and 10,000 capacitors, the ENIAC was a true engineering marvel of its time.",
            "The ENIAC performed 5,000 operations per second, an unparalleled speed for its time. For comparison, the ENIAC was about a thousand times faster than the mechanical computing systems of its era.",
            "Unlike modern computers, the ENIAC did not have programmable memory. Its programming was done manually, by connecting cables and adjusting switches, making it take days to switch from one program to another."
        ],
        "topico1": "Challenges",
        "descricao1": "Developing the ENIAC was an innovative but extremely challenging process. The machine's gigantic size and the massive use of vacuum tubes led to frequent technical failures. The heat generated by the equipment was immense, requiring complex cooling solutions.",
        "topico2": "Innovation and Objectives",
        "descricao2": "Despite its challenges, the ENIAC proved to be a game changer in computing. Its success inspired the creation of more advanced and smaller computers, paving the way for the development of programming languages and digital data storage. The ENIAC also influenced the development of modern computer architecture, such as the von Neumann architecture, which is still used in most computer systems today.",
        "topico3": "",
        "descricao3": "",
        "sobrenos": "https://en.wikipedia.org/wiki/ENIAC",
        "arquivos": "",
        "fotoPrincipal": "imagens/primeiro-computador.png",
        "fotos": ""
    },
    {
        "id": "projeto-exemplo",
        "titulo": "Project Title",
        "desenvolvedores": [
            "Dev1",
            "Dev2",
            "Dev3",
            "Dev4",
            "Dev5",
            "Dev6"
        ],
        "dataInicio": "DD/MM/YY",
        "dataFim": "DD/MM/YY",
        "local": "IBMEC Barra",
        "resumo": "Placeholder summary",
        "especificacoes": [
            "Specification 1",
            "Specification 2",
            "Specification 3",
            "Specification 4",
            "Specification 5"
        ],
        "detalhamento": [
            "Detail of specification 1",
            "Detail of specification 2",
            "Detail of specification 3",
            "Detail of specification 4",
            "Detail of specification 5"
        ],
        "topico1": "Topic 1 Name",
        "descricao1": "Description of topic 1",
        "topico2": "Topic 2 Name",
        "descricao2": "Description of topic 2",
        "topico3": "Topic 3 Name",
        "descricao3": "Description of topic 3",
        "sobrenos": "",
        "arquivos": "https://g1.globo.com",
        "fotoPrincipal": "imagens/old-computer-1.jpg",
        "fotos": [
            "imagens/old-computer-2.jpg",
            "imagens/old-computer-3.jpg",
            "imagens/old-computer-4.jpg"
        ]
    },
    {
        "id": "Optimus",
        "titulo": "Tesla's Optimus",
        "desenvolvedores": [
            "Tesla, Inc."
        ],
        "dataInicio": "2021",
        "dataFim": "In development",
        "local": "Tesla AI Day, Palo Alto, California, USA",
        "resumo": "Optimus is a humanoid robot designed by Tesla to perform repetitive and dangerous tasks, aimed at improving efficiency and safety in work and leisure environments.",
        "especificacoes": [
            "Height",
            "Weight",
            "Load capacity",
            "Maximum speed",
            "Design"
        ],
        "detalhamento": [
            "Approximately 1.73 meters",
            "Around 57 kg",
            "Up to 20 kg",
            "8 km/h",
            "Humanoid design that facilitates interaction in environments designed for humans.",
            "Equipped with advanced sensors and actuators for precise and safe movement.",
            "Uses the same AI technology as Tesla's autonomous vehicles.",
            "Capable of performing tasks such as carrying objects, operating tools, and performing basic movements.",
            "Developed to improve efficiency in production lines and other industrial applications."
        ],
        "topico1": "Movement Technology",
        "descricao1": "Optimus uses electric actuators for natural and safe movement.",
        "topico2": "AI Integration",
        "descricao2": "Equipped with Tesla's latest artificial intelligence technology for interaction and autonomous learning.",
        "topico3": "Practical Applications",
        "descricao3": "Designed to replace humans in repetitive and dangerous tasks, increasing safety and efficiency.",
        "sobrenos": "",
        "arquivos": "",
        "fotoPrincipal": "imagens/optimus-principal.webp",
        "fotos": [
            "imagens/optimus-1.jpg",
            "imagens/optimus-2.jpg",
            "imagens/optimus-3.jpg"
        ]
    },
    {
        "id": "Metaverso",
        "titulo": "Meta's Metaverse",
        "desenvolvedores": [
            "Meta."
        ],
        "dataInicio": "2021",
        "dataFim": "In development",
        "local": "Meta Headquarters, Menlo Park, California, USA",
        "resumo": "Meta's Metaverse (formerly Facebook) is a virtual reality (VR) and augmented reality (AR) platform aimed at creating an interactive and immersive digital environment where users can interact, socialize, work, study, and even conduct transactions. The project represents Meta's long-term vision for the future of the internet, combining social networks, VR/AR environments, artificial intelligence, and blockchain.",
        "especificacoes": [
            "Immersive Virtual and Augmented Reality",
            "Personalized and Expressive Avatars",
            "Customizable Virtual Environments"
        ],
        "detalhamento": [
            "Meta aims to create a fully immersive experience, allowing users to participate in the metaverse through VR devices like the Meta Quest 2 and Meta Quest Pro.",
            "Avatar creation is central to Meta's metaverse. Users can create digital representations of themselves, with detailed customization options to reflect their identities and styles.",
            "Users and creators have the freedom to create custom worlds in the metaverse using intuitive building tools. This allows anyone to create themed environments, games, meeting rooms, virtual events, and more."
        ],
        "topico1": "Technologies Used",
        "descricao1": "Meta's Metaverse is mainly accessed through devices like Meta Quest (formerly Oculus Quest), the company's virtual reality headset. In 2023, Meta launched the Meta Quest Pro, an advanced device that combines virtual and mixed reality (VR/AR) to create richer and more professional experiences.",
        "topico2": "Horizon Worlds Platform",
        "descricao2": "Horizon Worlds is Meta's Metaverse social platform where users can create avatars and interact in virtual environments. They can explore worlds created by other users, participate in virtual events, and build their own spaces within the metaverse.",
        "topico3": "Horizon Workrooms Platform",
        "descricao3": "In addition to Horizon Worlds, Meta launched Horizon Workrooms, aimed at virtual meetings in VR, allowing teams to work together in a 3D environment and create more immersive collaboration experiences.",
        "sobrenos": "",
        "arquivos": "",
        "fotoPrincipal": "imagens/Meta-Planets-img-16x9-1-e1635949371546.jpg",
        "fotos": ""
    }
]