[
    {
        "id": "primeiro-computador",
        "titulo": "O Primeiro Computador",
        "desenvolvedores": ["John Presper Eckert (Enhenheiro)", "John Mauchly (Engenheiro)"],
        "dataInicio": "1943",
        "dataFim": "1945",
        "local": "Universidade da Pensilvânia, Filadélfia, EUA",
        "resumo": "O ENIAC (Electronic Numerical Integrator and Computer) foi o primeiro computador eletrônico de uso geral, revolucionando a forma como cálculos eram realizados e marcando o início da era da computação. Originalmente desenvolvido para o Exército dos Estados Unidos durante a Segunda Guerra Mundial, o ENIAC foi projetado para calcular tabelas de artilharia, mas rapidamente se tornou uma peça fundamental na pesquisa científica e industrial.",
        "especificacoes": ["Dimensões", "Componentes", "Capacidade de processamento", "Programação manual"],
        "detalhamento": ["Com impressionantes 30 toneladas, o ENIAC ocupava uma sala inteira de aproximadamente 167 metros quadrados, o equivalente a uma pequena casa.", "Equipado com 17.468 válvulas a vácuo, 7.200 diodos de cristal, 1.500 relés, 70 mil resistores e 10 mil capacitores, o ENIAC era uma verdadeira obra de engenharia da época.", "O ENIAC realizava 5.000 operações por segundo, uma velocidade incomparável para os padrões da época. Para fins de comparação, o ENIAC era cerca de mil vezes mais rápido que os sistemas de computação mecânicos da época.", "Diferentemente dos computadores modernos, o ENIAC não possuía uma memória programável. A sua programação era feita manualmente, através da conexão de cabos e ajustes de interruptores. Isso fazia com que a mudança de um programa para outro levasse dias."],
        "topico1": "Desafios",
        "descricao1": "Desenvolver o ENIAC foi um processo inovador, mas extremamente desafiador. O tamanho gigantesco da máquina e o uso massivo de válvulas a vácuo resultavam em frequentes falhas técnicas. O calor gerado pelo equipamento era imenso, exigindo soluções complexas de refrigeração.",
        "topico2": "Inovação e Objetivos",
        "descricao2": "Apesar de seus desafios, o ENIAC provou ser um divisor de águas na computação. Seu sucesso inspirou a criação de computadores mais avançados e menores, além de pavimentar o caminho para o desenvolvimento de linguagens de programação e armazenamento digital de dados. O ENIAC também influenciou o desenvolvimento da arquitetura moderna de computadores, como o conceito de arquitetura de von Neumann, utilizada até hoje na maioria dos sistemas computacionais.",
        "topico3": "",
        "descricao3": "",
        "sobrenos": "https://pt.wikipedia.org/wiki/ENIAC",
        "arquivos": "",
        "fotoPrincipal": "imagens/primeiro-computador.png",
        "fotos": ""
    },
    {
        "id": "projeto-exemplo",
        "titulo": "Título do Projeto",
        "desenvolvedores": ["Dev1", "Dev2", "Dev3", "Dev4", "Dev5", "Dev6"],
        "dataInicio": "DD/MM/AA",
        "dataFim": "DD/MM/AA",
        "local": "IBMEC Barra",
        "resumo": "Resumo placeholder",
        "especificacoes": ["Especificação 1", "Especificação 2","Especificação 3", "Especificação 4", "Especificação 5"],
        "detalhamento": ["Detalhamento da especificação 1", "Detalhamento da especificação 2", "Detalhamento da especificação 3", "Detalhamento da especificação 4", "Detalhamento da especificação 5"],
        "topico1": "Nome do tópico 1",
        "descricao1": "Descrição do tópico 1",
        "topico2": "Nome do tópico 2",
        "descricao2": "Descrição do tópico 2",
        "topico3": "Nome do tópico 3",
        "descricao3": "Descrição do tópico 3",
        "sobrenos": "",
        "arquivos": "https://g1.globo.com",
        "fotoPrincipal": "imagens/old-computer-1.jpg",
        "fotos": ["imagens/old-computer-2.jpg", "imagens/old-computer-3.jpg", "imagens/old-computer-4.jpg"]
    }
  ]